Revit 2027 API
EnergyDataSettings.CheckBuildingEnvelope Method
 Checks that the building envelope determination method falls within an appropriate range.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool CheckBuildingEnvelope(
	gbXMLExportBuildingEnvelope determinationMethod
)
Public Shared Function CheckBuildingEnvelope (
	determinationMethod As gbXMLExportBuildingEnvelope
) As Boolean
public:
static bool CheckBuildingEnvelope(
	gbXMLExportBuildingEnvelope determinationMethod
)
static member CheckBuildingEnvelope :
        determinationMethod : gbXMLExportBuildingEnvelope -> bool
Parameters
determinationMethod gbXMLExportBuildingEnvelope
 The building envelope determination method to be checked.
Return Value
Boolean
 True if the building envelope determination method falls within an appropriate range, false otherwise.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace